// Функция для генерации случайных карт
export function generateRandomCards(count: number): string[] {
    const tarotDeck = [
        "Шут", "Маг", "Верховная Жрица", "Императрица", "Император", "Влюблённые", "Колесница", "Сила", "Отшельник", "Колесо Фортуны", "Справедливость", "Повешенный", "Смерть", "Умеренность", "Дьявол",
        "Башня", "Звезда", "Луна", "Солнце", "Суд", "Мир", "Туз жезлов", "Двойка жезлов", "Тройка жезлов", "Четвёрка жезлов", "Пятерка жезлов", "Шестерка жезлов", "Семерка жезлов", "Восьмерка жезлов", "Девятка жезлов",
        "Паж жезлов", "Рыцарь жезлов", "Королева жезлов", "Король жезлов", "Туз кубков", "Двойка кубков", "Тройка кубков", "Четвёрка кубков", "Пятерка кубков", "Шестерка кубков", "Семерка кубков", "Восьмерка кубков", "Девятка кубков",
        "Паж кубков", "Рыцарь кубков", "Королева кубков", "Король кубков", "Туз мечей", "Двойка мечей", "Тройка мечей", "Четвёрка мечей", "Пятерка мечей", "Шестерка мечей", "Семерка мечей", "Восьмерка мечей", "Девятка мечей",
        "Паж мечей", "Рыцарь мечей", "Королева мечей", "Король мечей", "Туз пентаклей", "Двойка пентаклей", "Тройка пентаклей", "Четвёрка пентаклей", "Пятерка пентаклей", "Шестерка пентаклей", "Семерка пентаклей", "Восьмерка пентаклей", "Девятка пентаклей",
        "Паж пентаклей", "Рыцарь пентаклей", "Королева пентаклей", "Король пентаклей"
    ];
    
    return Array.from({ length: count }, () => {
        const randomIndex = Math.floor(Math.random() * tarotDeck.length);
        return tarotDeck[randomIndex];
    });
}